---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.RailStructure
source: html/3beb67d2-4fc5-97d2-8314-6e848e11d56a.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.RailStructure Property

The NonContinuousRailStructure.

## Syntax (C#)
```csharp
public NonContinuousRailStructure RailStructure { get; }
```